gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
/*
 * Board Config
 *
 *  Created on: 3 Feb 2019
 *      Author: sdavi
 */



#include <stdio.h>
#include <ctype.h>
#include <string.h>
#include <stdint.h>
#include "Version.h"
#include "BoardConfig.h"
#include "RepRapFirmware.h"
#include "sd_mmc.h"
#include "SPI.h"
#include "HardwareSPI.h"
#include "HardwareSDIO.h"
#include "Platform/Platform.h"

#include "HybridPWM.h"
#include "ff.h"
#include "Hardware/SoftwareReset.h"
#include "Hardware/ExceptionHandlers.h"

#include "pinmap.h"

#if STM32H7
# include "stm32h7xx_ll_system.h"
# include "core_cm7.h"
#else
# include "stm32f4xx_ll_system.h"
# include "core_cm4.h"
#endif

#if SUPPORT_TMC22xx || SUPPORT_DMA_NEOPIXEL
# include "DMABitIO.h"
#endif
#ifdef TEST_CACHE
extern uint32_t _nocache_ram_start;
extern uint32_t _nocache_ram_end;
#if STM32H7
extern uint32_t _nocache2_ram_start;
extern uint32_t _nocache2_ram_end;
#endif
#include <Cache.h>
#endif


char BoardName[MaxBoardNameLength];
#if HAS_SBC_INTERFACE
char iapFirmwareFile[MaxBoardNameLength*2] = SBC_IAP_FIRMWARE_FILE;
#else
char iapFirmwareFile[MaxBoardNameLength*2] = WIFI_IAP_FIRMWARE_FILE;
#endif
typedef enum {
    SD_SPI1_A,
    SD_SPI1_B,
    SD_SDIO,
    SD_SPI3_A,
    SD_SPI3_B,
    SD_SPI2_A,
    SD_UNKNOWN = 0xfe,
    SD_NONE = 0xff
} SDConfigs;

SDConfigs sdConfig = SD_UNKNOWN;

static constexpr char boardConfigFile[] = "0:/sys/board.txt";
static constexpr char bootConfigFile[] = "0:/rrfboot.txt";
static constexpr char pinsConfigFile[] = "0:/rrfpins.txt";

//All other board configs
static const boardConfigEntry_t boardConfigs[]=
{
    {"board", &BoardName, 1, cvStringType},
    {"leds.diagnostic", &DiagPin, 1, cvPinType},
    {"leds.diagnosticOn", &DiagOnPolarity, 1, cvBoolType},
    {"leds.activity", &ActLedPin, 1, cvPinType},
    {"leds.activityOn", &ActOnPolarity, 1, cvBoolType},

    // initial pin states
    {"pins.SetHigh", PinsSetHigh, MaxInitialPins, cvPinType},
    {"pins.SetLow", PinsSetLow, MaxInitialPins, cvPinType},

    //Steppers
    {"stepper.numDrivers", &totalSmartDrivers, 1, cvUint32Type},
    {"stepper.powerEnablePin", &StepperPowerEnablePin, 1, cvPinType},
    {"stepper.enablePins", ENABLE_PINS, NumDirectDrivers, cvPinType},
    {"stepper.stepPins", STEP_PINS, NumDirectDrivers, cvPinType},
    {"stepper.directionPins", DIRECTION_PINS, NumDirectDrivers, cvPinType},
    {"stepper.digipotFactor", &digipotFactor, 1, cvFloatType},
#if HAS_SMART_DRIVERS
    {"stepper.TmcUartPins", TMC_PINS, NumDirectDrivers, cvPinType},
    {"stepper.DriverType", TMC_DRIVER_TYPE, NumDirectDrivers, cvDriverType},
    {"stepper.numSmartDrivers", &totalSmartDrivers, 1, cvUint32Type},
#if SUPPORT_TMC51xx
    {"stepper.num5160Drivers", &num5160SmartDrivers, 1, cvUint32Type},
    {"stepper.spiChannel", &SmartDriversSpiChannel, 1, cvUint8Type},
    {"stepper.csDelay", &SmartDriversSpiCsDelay, 1, cvUint32Type},
#endif
#if HAS_STALL_DETECT && SUPPORT_TMC22xx
    {"stepper.TmcDiagPins", DriverDiagPins, NumDirectDrivers, cvPinType},
#endif
#endif
    //Heater sensors
    {"heat.tempSensePins", TEMP_SENSE_PINS, NumThermistorInputs, cvPinType},
    {"heat.spiTempSensorCSPins", SpiTempSensorCsPins, MaxSpiTempSensors, cvPinType},
    {"heat.spiTempSensorChannel", &TempSensorSSPChannel, 1, cvUint8Type},
    {"heat.thermistorSeriesResistor", &DefaultThermistorSeriesR, 1, cvFloatType},
    
    //ATX Power
    {"atx.powerPin", &ATX_POWER_PIN, 1, cvPinType},
    {"atx.powerPinInverted", &ATX_POWER_INVERTED, 1, cvBoolType},
    {"atx.initialPowerOn", &ATX_INITIAL_POWER_ON, 1, cvBoolType},

    //SDCards
    {"sdcard.internal.type", &sdConfig, 1, cvUint32Type},
    {"sdCard.internal.spiFrequencyHz", &InternalSDCardFrequency, 1, cvUint32Type},
    {"sdCard.external.csPin", &SdSpiCSPins[1], 1, cvPinType},
    {"sdCard.external.cardDetectPin", &SdCardDetectPins[1], 1, cvPinType},
    {"sdCard.external.spiFrequencyHz", &ExternalSDCardFrequency, 1, cvUint32Type},
    {"sdCard.external.spiChannel", &ExternalSDCardSSPChannel, 1, cvUint8Type},

#if SUPPORT_12864_LCD
    {"lcd.lcdCSPin", &LcdCSPin, 1, cvPinType},
    {"lcd.lcdBeepPin", &LcdBeepPin, 1, cvPinType},
    {"lcd.encoderPinA", &EncoderPinA, 1, cvPinType},
    {"lcd.encoderPinB", &EncoderPinB, 1, cvPinType},
    {"lcd.encoderPinSw", &EncoderPinSw, 1, cvPinType},
    {"lcd.lcdDCPin", &LcdA0Pin, 1, cvPinType},
    {"lcd.panelButtonPin", &PanelButtonPin, 1, cvPinType},
    {"lcd.spiChannel", &LcdSpiChannel, 1, cvUint8Type},
#endif
    
    {"SPI0.pins", SPIPins[0], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI1.pins", SPIPins[1], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI2.pins", SPIPins[2], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI3.pins", SPIPins[3], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI4.pins", SPIPins[4], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI5.pins", SPIPins[5], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#if STM32H7
    {"SPI6.pins", SPIPins[6], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI7.pins", SPIPins[7], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI8.pins", SPIPins[8], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#endif
    
#if HAS_WIFI_NETWORKING
    {"8266wifi.espDataReadyPin", &EspDataReadyPin, 1, cvPinType},
    {"8266wifi.lpcTfrReadyPin", &SamTfrReadyPin, 1, cvPinType},
    {"8266wifi.TfrReadyPin", &SamTfrReadyPin, 1, cvPinType},
    {"8266wifi.espResetPin", &EspResetPin, 1, cvPinType},
    {"8266wifi.csPin", &SamCsPin, 1, cvPinType},
    {"8266wifi.serialRxTxPins", &WifiSerialRxTxPins, NumberSerialPins, cvPinType},
    {"8266wifi.spiChannel", &WiFiSpiChannel, 1, cvUint8Type},    
    {"8266wifi.clockReg", &WiFiClockReg, 1, cvUint32Type},
#endif

#if HAS_SBC_INTERFACE
    {"sbc.TfrReadyPin", &SbcTfrReadyPinConfig, 1, cvPinType},
    {"sbc.csPin", &SbcCsPinConfig, 1, cvPinType},
    {"sbc.spiChannel", &SbcSpiChannel, 1, cvUint8Type},    
    {"sbc.loadConfig", &SbcLoadConfig, 1, cvBoolType},    
#endif

#if defined(SERIAL_AUX_DEVICE)
    {"serial.aux.rxTxPins", &AuxSerialRxTxPins, NumberSerialPins, cvPinType},
#endif
#if defined(SERIAL_AUX2_DEVICE)
    {"serial.aux2.rxTxPins", &Aux2SerialRxTxPins, NumberSerialPins, cvPinType},
#endif
    
#if SUPPORT_LED_STRIPS
    {"led.neopixelPin", &NeopixelOutPin, 1, cvPinType},
#endif

#if HAS_VOLTAGE_MONITOR
    {"power.VInDetectPin", &PowerMonitorVinDetectPin, 1, cvPinType},
    {"power.voltage", &VInDummyReading, 1, cvUint32Type},
#endif
#if SUPPORT_ACCELEROMETERS
    {"accelerometer.spiChannel", &AccelerometerSpiChannel, 1, cvUint8Type},
#endif
#if SUPPORT_SPICAN
    {"can.spiChannel", &CanSpiChannel, 1, cvUint8Type},
    {"can.csPin", &CanCsPin, 1, cvPinType},
    {"can.spiFrequencyHz", &CanSpiFrequency, 1, cvUint32Type},
#endif
#if STM32H7
    {"can.readPin", &CanReadPin, 1, cvPinType},
    {"can.writePin", &CanWritePin, 1, cvPinType},
#endif
};


static void ClearConfig() noexcept
{
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        boardConfigEntry_t next = boardConfigs[i];
        debugPrintf("config item %d name %s\n", i, next.key);
        for(size_t p=0; p<(next.numItems); p++)
        {
            switch(next.type)
            {
                case cvPinType:
                    ((Pin *)(next.variable))[p] = NoPin;
                    break;
                case cvDriverType:
                    ((DriverType *)(next.variable))[p] = DriverType::unknown;
                    break;
                case cvBoolType:
                    ((bool *)(next.variable))[p] = false;
                    break;
                case cvFloatType:
                    ((float *)(next.variable))[p] = 0.0f;
                    break;
                case cvUint8Type:
                    ((uint8_t *)(next.variable))[p] = 0;
                    break;
                case cvUint16Type:
                    ((uint16_t *)(next.variable))[p] = 0;
                   break;
                case cvUint32Type:
                    ((uint32_t *)(next.variable))[p] = 0;
                    break;
                case cvStringType:
                    strcpy((char *)(next.variable), "");
                    break;
                default:
                    break;
            }
        }
    }
    // We have a few settings that have "special" default values
    TempSensorSSPChannel = SSPNONE;
    DefaultThermistorSeriesR = 4700.0;
    ATX_INITIAL_POWER_ON = true;
    SdSpiCSPins[0] = PA_4;
    SdCardDetectPins[0] = NoPin;
    SdSpiCSPins[1] = NoPin;
    SdCardDetectPins[1] = NoPin;
    ExternalSDCardFrequency = 4000000;
    ExternalSDCardSSPChannel = SSPNONE;
    InternalSDCardFrequency = 25000000;
    LcdSpiChannel = SSPNONE;
    DiagOnPolarity = true;
    ActOnPolarity = true;
    SmartDriversSpiChannel = SSPNONE;
    debugPrintf("clear 1\n");
#if HAS_WIFI_NETWORKING
    SamCsPin = PB_12;
    WiFiSpiChannel = SSP2;
#endif
#if defined(SERIAL_AUX_DEVICE)
    AuxSerialRxTxPins[0] = PA_10;
    AuxSerialRxTxPins[1] = PA_9;
#endif
#if HAS_SBC_INTERFACE
    SbcCsPinConfig = PB_12;
    SbcSpiChannel = SSP2;
#endif
debugPrintf("clear 2\n");
#if SUPPORT_SPICAN
    CanSpiFrequency = 15000000;
#endif
#if STM32H7
    CanReadPin = PB_8;
    CanWritePin = PB_9;
#endif
#if HAS_VOLTAGE_MONITOR
    VInDummyReading = 24;
#endif
#if SUPPORT_ACCELEROMETERS
    AccelerometerSpiChannel = SSPNONE;
#endif
    sdConfig = SD_UNKNOWN;
    debugPrintf("clear 3\n");
}


static void InitDiagPin()
{
    bool dummy;
    LogicalPin pin;
    if (LookupPinName("status", pin, dummy))
    {
        DiagPin = (Pin)pin;
    }
}

static bool LoadBoardDefaults() noexcept
{
    debugPrintf("Load board defaults\n");
    ClearConfig();
    debugPrintf("after clear\n");
    // Load the configuration from the embedded file system
    if (BoardConfig::LoadBoardConfigFromFile(bootConfigFile))
    {
        debugPrintf("Found embedded config: board %s\n", BoardName);
        // we use the name configured here for the firmware file
#if HAS_SBC_INTERFACE
        SafeSnprintf(iapFirmwareFile, sizeof(iapFirmwareFile), "firmware-%s-sbc.bin", BoardName);
#else
        SafeSnprintf(iapFirmwareFile, sizeof(iapFirmwareFile), "firmware-%s-wifi.bin", BoardName);
#endif
        InitDiagPin();
        return true;
    }
    return false;
}


uint32_t crc32_for_byte(uint32_t r) 
{
    for(int j = 0; j < 8; ++j)
        r = (r & 1? 0: (uint32_t)0xEDB88320L) ^ r >> 1;
    return r ^ (uint32_t)0xFF000000L;
}

uint32_t crc32(const void *data, size_t n_bytes) 
{
    uint32_t table[0x100];
    uint32_t crc = 0;

