gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
    for(size_t i = 0; i < 0x100; ++i)
        table[i] = crc32_for_byte(i);
    for(size_t i = 0; i < n_bytes; ++i)
        crc = table[(uint8_t)crc ^ ((uint8_t*)data)[i]] ^ crc >> 8;
    return crc;
}


#if HAS_SBC_INTERFACE
class InMemoryBoardConfiguration
{
public:
    InMemoryBoardConfiguration() : signature(invalidSignature), length(0) {}
    bool isValid() noexcept;
    void setConfiguration() noexcept;
    void getConfiguration() noexcept;
    void saveToBackupRAM() noexcept;
    void loadFromBackupRAM() noexcept;
    bool isEqual(InMemoryBoardConfiguration& other) noexcept;
private:
    static constexpr uint32_t validSignature = 0xBCBC0002;
    static constexpr uint32_t invalidSignature = 0xBAD0BAD1;
    static constexpr int maxData = 512;
    uint32_t signature;
    uint32_t configEntrySig;
    uint32_t length;
    uint8_t data[maxData];
};

bool InMemoryBoardConfiguration::isValid() noexcept
{
    //debugPrintf("Memory at %x signature %x confSig %x\n", (unsigned)this, (unsigned) signature, (unsigned)configEntrySig);
    return signature == validSignature && configEntrySig == crc32(boardConfigs, sizeof(boardConfigs));
}

void InMemoryBoardConfiguration::setConfiguration() noexcept
{
    if (!isValid()) debugPrintf("Warning: Setting configuration from invalid memory\n");
    uint8_t *pmem = data;
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        const boardConfigEntry_t item = boardConfigs[i];
        uint32_t len = item.numItems*CVTLengths[item.type];
        memcpy(item.variable, pmem, len);
        pmem += len;
    }
}

void InMemoryBoardConfiguration::getConfiguration() noexcept
{
    uint8_t *pmem = data;
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        const boardConfigEntry_t item = boardConfigs[i];
        uint32_t len = item.numItems*CVTLengths[item.type];
        memcpy(pmem, item.variable, len);
        pmem += len;
        if (pmem - data > maxData)
        {
            debugPrintf("Warning configuration data too large\n");
            return;
        }
    }
    length = pmem - data;
    signature = validSignature;
    configEntrySig = crc32(boardConfigs, sizeof(boardConfigs));
    //debugPrintf("config length %d sig %x\n", (int)length, (unsigned)configEntrySig);
}

void InMemoryBoardConfiguration::saveToBackupRAM() noexcept
{
    // enable access to backup RAM
#if STM32H7
    __HAL_RCC_BKPRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy((void *)D3_BKPSRAM_BASE, this, sizeof(InMemoryBoardConfiguration));
#else
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_RCC_BKPSRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy((void *)BKPSRAM_BASE, this, sizeof(InMemoryBoardConfiguration));
#endif
}

void InMemoryBoardConfiguration::loadFromBackupRAM() noexcept
{
    // enable access to backup RAM
#if STM32H7
    __HAL_RCC_BKPRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy(this, (void *)D3_BKPSRAM_BASE, sizeof(InMemoryBoardConfiguration));
#else
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_RCC_BKPSRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy(this, (void *)BKPSRAM_BASE, sizeof(InMemoryBoardConfiguration));
#endif
    //if (isValid())
        //debugPrintf("Loaded valid configuration data from backup RAM\n");
}


bool InMemoryBoardConfiguration::isEqual(InMemoryBoardConfiguration& other) noexcept
{
    return (isValid() && other.isValid() && length == other.length && !memcmp(data, other.data, length));
}
#endif


static inline bool isSpaceOrTab(char c) noexcept
{
    return (c == ' ' || c == '\t');
}
    
BoardConfig::BoardConfig() noexcept
{
}

static void ConfigureGPIOPins() noexcept
{
    initInterruptPins();
    for(size_t i = 0; i < MaxInitialPins; i++)
    {
        pinMode(PinsSetLow[i], OUTPUT_LOW);
        pinMode(PinsSetHigh[i], OUTPUT_HIGH);
        pinMode(SpiTempSensorCsPins[i], INPUT_PULLUP);
    }
    // Handle special cases
    //Init pins for LCD
    //make sure to init ButtonPin as input incase user presses button
    pinMode(PanelButtonPin, INPUT);
    pinMode(LcdA0Pin, OUTPUT_HIGH);
    pinMode(LcdBeepPin, OUTPUT_LOW);
    // Set the 12864 display CS pin low to prevent it from receiving garbage due to other SPI traffic
    pinMode(LcdCSPin, OUTPUT_LOW);

    //Init Diagnostcs Pin
#if STARTUP_DELAY
    if ((CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) != 0)
    {
        // Debugger is active do not allow use of those pins for diag light
        if (DiagPin == SWDIO_PIN || DiagPin == SWCLK_PIN)
            DiagPin = NoPin;
    } 
#endif

    pinMode(DiagPin, OUTPUT_LOW);

    // Configure ATX power control
    ATX_POWER_STATE = ATX_INITIAL_POWER_ON;
    pinMode(StepperPowerEnablePin, (ATX_POWER_STATE ? OUTPUT_HIGH : OUTPUT_LOW));
}

static void ConfigureSPIPins(SSPChannel dev, Pin clk, Pin miso, Pin mosi) noexcept
{
    SPI::getSSPDevice(dev)->initPins(clk, miso, mosi, NvicPrioritySpi);
}

static void ConfigureDriveType() noexcept
{
    // first check to see if we have any explcit settings
    for(size_t i = 0; i < NumDirectDrivers; i++)
    {
        if (TMC_DRIVER_TYPE[i] != DriverType::unknown)
        {
            // at least one driver has been set, so we assume all have been
            return;
        }
    }
    // individual drivers have not been set, so we configure using "legacy" settings
    for(size_t i = 0; i < num5160SmartDrivers; i++)
        TMC_DRIVER_TYPE[i] = DriverType::tmcspiauto;
    for(size_t i = num5160SmartDrivers; i < totalSmartDrivers; i++)
        TMC_DRIVER_TYPE[i] = DriverType::tmcuartauto;
    for(size_t i = totalSmartDrivers; i < NumDirectDrivers; i++)
        TMC_DRIVER_TYPE[i] = DriverType::stepdir;
}

static void FatalError(const char* fmt, ...) noexcept
{
    for(;;)
    {
        va_list vargs;
        va_start(vargs, fmt);
        reprap.GetPlatform().DebugMessage(fmt, vargs);
        va_end(vargs);
        delay(2000);
    }
}

static void MessageF(MessageType mtype, const char* fmt, ...) noexcept
{
    va_list vargs;
    va_start(vargs, fmt);
    reprap.GetPlatform().MessageV(mtype, fmt, vargs);
    va_end(vargs);
}

static void FlushMessages() noexcept
{
    uint32_t start = millis();
    while(reprap.GetPlatform().FlushMessages() && (millis() - start < 5000))
        ;
}

